In [12]:
import pandas as pd
import numpy as np

In [13]:
data= pd.read_csv('../data/Victims_of_rape.csv')
data.head()

,Area_Name,Year,Subgroup,Rape_Cases_Reported,Victims_Above_50_Yrs,Victims_Between_10-14_Yrs,Victims_Between_14-18_Yrs,Victims_Between_18-30_Yrs,Victims_Between_30-50_Yrs,Victims_of_Rape_Total,Victims_Upto_10_Yrs
0,Andaman & Nicobar Islands,2001,Total Rape Victims,3,0,0,3,0,0,3,0
1,Andaman & Nicobar Islands,2001,Victims of Incest Rape,1,0,0,1,0,0,1,0
2,Andaman & Nicobar Islands,2001,Victims of Other Rape,2,0,0,2,0,0,2,0
3,Andaman & Nicobar Islands,2002,Total Rape Victims,2,0,0,1,1,0,2,0
4,Andaman & Nicobar Islands,2002,Victims of Incest Rape,0,0,0,0,0,0,0,0

In [14]:
data.shape

(1050, 11)

In [15]:
data.drop(["Rape_Cases_Reported"],axis=1, inplace=True)
data.drop(["Victims_Above_50_Yrs"],axis=1, inplace=True)
data.drop(["Victims_Between_10-14_Yrs"],axis=1, inplace=True)
data.drop(["Victims_Between_14-18_Yrs"],axis=1, inplace=True)
data.drop(["Victims_Between_18-30_Yrs"],axis=1, inplace=True)
data.drop(["Victims_Between_30-50_Yrs"],axis=1, inplace=True)
data.drop(["Victims_Upto_10_Yrs"],axis=1, inplace=True)
data.head()

,Area_Name,Year,Subgroup,Victims_of_Rape_Total
0,Andaman & Nicobar Islands,2001,Total Rape Victims,3
1,Andaman & Nicobar Islands,2001,Victims of Incest Rape,1
2,Andaman & Nicobar Islands,2001,Victims of Other Rape,2
3,Andaman & Nicobar Islands,2002,Total Rape Victims,2
4,Andaman & Nicobar Islands,2002,Victims of Incest Rape,0

In [16]:
data = data[data['Subgroup'] == "Total Rape Victims"]
data.head()

                    Area_Name  Year            Subgroup  Victims_of_Rape_Total
0   Andaman & Nicobar Islands  2001  Total Rape Victims                      3
3   Andaman & Nicobar Islands  2002  Total Rape Victims                      2
6   Andaman & Nicobar Islands  2003  Total Rape Victims                      2
9   Andaman & Nicobar Islands  2004  Total Rape Victims                     10
12  Andaman & Nicobar Islands  2005  Total Rape Victims                      4

In [17]:
data.drop(["Subgroup"],axis=1, inplace=True)
data.head()

                    Area_Name  Year  Victims_of_Rape_Total
0   Andaman & Nicobar Islands  2001                      3
3   Andaman & Nicobar Islands  2002                      2
6   Andaman & Nicobar Islands  2003                      2
9   Andaman & Nicobar Islands  2004                     10
12  Andaman & Nicobar Islands  2005                      4

In [18]:
data.shape

(350, 3)

In [19]:
data.isnull().sum()

Area_Name                0
Year                     0
Victims_of_Rape_Total    0
dtype: int64

In [20]:
datakeys=['Area_Name']
for i in datakeys:
    print(i,data[i].unique())

Area_Name ['Andaman & Nicobar Islands' 'Andhra Pradesh' 'Arunachal Pradesh' 'Assam'
 'Bihar' 'Chandigarh' 'Chhattisgarh' 'Dadra & Nagar Haveli' 'Daman & Diu'
 'Delhi' 'Goa' 'Gujarat' 'Haryana' 'Himachal Pradesh' 'Jammu & Kashmir'
 'Jharkhand' 'Karnataka' 'Kerala' 'Lakshadweep' 'Madhya Pradesh'
 'Maharashtra' 'Manipur' 'Meghalaya' 'Mizoram' 'Nagaland' 'Odisha'
 'Puducherry' 'Punjab' 'Rajasthan' 'Sikkim' 'Tamil Nadu' 'Tripura'
 'Uttar Pradesh' 'Uttarakhand' 'West Bengal']

In [21]:
from sklearn.preprocessing import LabelEncoder
a=LabelEncoder()
for i in datakeys:
    data[i]=a.fit_transform(data[i])
data.head()

    Area_Name  Year  Victims_of_Rape_Total
0           0  2001                      3
3           0  2002                      2
6           0  2003                      2
9           0  2004                     10
12          0  2005                      4

In [22]:
data.to_csv("../data/final_rapedataset.csv")